Repository: pylapp/miso-ios-demo
Catalog: DesignToolbox/DesignToolbox/Resources/Localizable.xcstrings
Source language: en
Languages: ar, fr

# app_components_switch_description_text
source: Switch is a UI element that allows to toggle between two states, typically “On” and “Off”, and used to enable or disable features, options or settings.
ar: المفتاح هو عنصر واجهة مستخدم يسمح بالتبديل بين حالتين، عادةً "تشغيل" و "إيقاف"، ويستخدم لتمكين أو تعطيل الميزات أو الخيارات أو الإعدادات.
fr: Un interrupteur est un élément d'interface utilisateur qui permet de basculer entre deux états, généralement « Marche » et « Arrêt », et qui sert à activer ou désactiver des fonctionnalités, des options ou des paramètres.

# app_components_switch_hint_a11y
source: This is a fake hint for the design system toolbox app
ar: هذه تلميح زائف لتطبيق صندوق أدوات نظام التصميم
fr: Ceci est un conseil bidon pour l’app de démo du design system

# app_components_switch_switch_description_text
source: Switch is a UI element that allows to toggle between two states, typically "On" and "Off", and used to enable or disable features, options or settings. Switch that does not show icon or text, provides greater flexibility when creating other components that require a Switch to be displayed.
ar: المفتاح هو عنصر واجهة مستخدم يسمح بالتبديل بين حالتين، عادةً "تشغيل" و"إيقاف"، ويُستخدم لتمكين أو تعطيل الميزات أو الخيارات أو الإعدادات. يوفر المفتاح الذي لا يعرض أيقونة أو نصًا مرونة أكبر عند إنشاء مكونات أخرى تتطلب عرض المفتاح.
fr: Un interrupteur est un élément d'interface utilisateur permettant de basculer entre deux états, généralement « Activé » et « Désactivé », et servant à activer ou désactiver des fonctionnalités, des options ou des paramètres. Un interrupteur sans icône ni texte offre une plus grande flexibilité lors de la création d'autres composants nécessitant son affichage.

# app_components_switch_switchItem_description_text
source: Switch item is a UI element that allows to toggle between two states, typically "On" and "Off", and used to enable or disable features, options or settings. Switch Item covers a wider range of contexts by allowing to toggle the visibility of additional text labels and icon assets.
ar: يُتيح لك مفتاح التبديل المُحسّن التبديل بين حالتين، عادةً "تشغيل" و"إيقاف"، ويُستخدم لتمكين أو تعطيل الميزات أو الخيارات أو الإعدادات. كما يُغطي هذا العنصر نطاقًا أوسع من السياقات، حيث يُتيح لك أيضًا إدارة عرض تسميات نصية وأيقونات إضافية.
fr: Un interrupteur enrichi permet de basculer entre deux états, généralement « Activé » et « Désactivé », et sert à activer ou désactiver des fonctionnalités, des options ou des paramètres. Cet élément couvre un plus large éventail de contextes en permettant également de gérer l'affichage d'étiquettes textuelles et d'icônes supplémentaires.

# app_components_tabBar_description_text
source: A tab bar is a navigation element that offers users different screens and interfaces within an application. This bar is located at the bottom of the device on iOS, on the side for visionOS, and at the top on macOS and iPadOS. The tab bar's visual style also changes depending on the OS version: Liquid Glass is implemented starting with version 26; otherwise, the older visual style is used. OUDS provides a tab bar based on standard Apple elements, ensuring consistent accessibility and compatibility across platforms.
ar: شريط علامات التبويب هو عنصر تنقل يُتيح للمستخدمين شاشات وواجهات استخدام مُختلفة داخل التطبيق. يقع هذا الشريط أسفل الجهاز في نظام iOS، وعلى جانبه في نظام VisionOS، وفي أعلاه في نظامي macOS وiPadOS. يتغير الشكل المرئي لشريط علامات التبويب أيضًا وفقًا لإصدار نظام التشغيل: يُطبّق Liquid Glass بدءًا من الإصدار 26؛ وفي غير ذلك، يُستخدم الشكل المرئي الأقدم. يوفر OUDS شريط علامات تبويب قائمًا على عناصر Apple القياسية، مما يضمن سهولة الوصول والتوافق المُستمرين عبر جميع المنصات.
fr: Une barre d’onglets est un élément de navigation proposant à l’utilisateur différents écrans et univers dans l’application. Cette barre est en bas de l’appareil sur iOS, ou sur le côté pour visionOS, ou en haut sur macOS et iPadOS. La barre d’onglets a également un style visuel changeant selon la version de l’OS : pour à partir de la version 26 Liquid Glass est implémenté, autrement l’ancien style visuel est appliqué. OUDS fournit d’ailleurs une barre d’onglet se reposant sur les éléments standards Apple, notamment pour avoir le même niveau d’accessibilité et de compatibilité entre plateformes.

# app_components_tabBar_labeltem_label
source: Label
ar: ملصق

# app_components_tabBar_newElements_label
source: New elements
ar: عناصر جديدة
fr: Nouveaux éléments

# app_components_tabBar_newElementsCount_label
source: %@ new element(s)
ar: %@ عنصر (عناصر) جديد
fr: %@ nouveau(x) élément(s)

# app_components_tag_description_text
source: Tag is a UI element that displays short information such as a label, a keyword or a category.
ar: الوسم هو عنصر من عناصر واجهة المستخدم يعرض معلومات قصيرة مثل التسمية أو الكلمة الرئيسية أو الفئة.
fr: Une étiquette est un élément d'interface utilisateur qui affiche de courtes informations telles qu'un libellé, un mot-clé ou une catégorie.

# app_components_tag_inputTag_description_text
source: Input tag is a UI element that allows to enter multiple values, each represented as a tag. As users type and submit values (usually by pressing enter, comma, or tab), each value is transformed into a tag. Input tag is often used for adding labels, categories, or participants.
ar: حقل الإدخال هو عنصر في واجهة المستخدم يسمح للمستخدمين بإدخال قيم متعددة، كل قيمة ممثلة بتسمية. عند إدخال المستخدم للقيم وتأكيدها (عادةً بالضغط على مفتاح الإدخال أو الفاصلة أو مفتاح الجدولة)، تُحوّل كل قيمة إلى تسمية. تُستخدم حقول الإدخال غالبًا لإضافة تسميات أو فئات أو مشاركين.
fr: L’étiquette de saisie est un élément d'interface utilisateur permettant de saisir plusieurs valeurs, chacune étant représentée par une étiquette. Lorsque l'utilisateur saisit et valide des valeurs (généralement en appuyant sur Entrée, virgule ou tabulation), chaque valeur est transformée en une étiquette. Le champ de saisie est souvent utilisé pour ajouter des libellés, des catégories ou des participants.

# app_components_tag_tag_description_text
source: Tag is a UI element that allows to display short info like a label, keyword, or category. Tag helps users quickly find, group, or understand content.
ar: الوسم هو عنصر من عناصر واجهة المستخدم يسمح بعرض معلومات مختصرة مثل التسمية أو الكلمة المفتاحية أو الفئة. يساعد الوسم المستخدمين على إيجاد المحتوى وتصنيفه وفهمه بسرعة.
fr: Une étiquette est un élément d'interface utilisateur permettant d'afficher des informations concises telles qu'un libellé, un mot-clé ou une catégorie. Elle aide les utilisateurs à trouver, regrouper ou comprendre rapidement du contenu.

# app_components_textArea_description_text
source: Text area is a UI element that allows to type, edit, or select multiple lines of textual data, such as comments, messages or descriptions.
ar: منطقة النص هي عنصر من عناصر واجهة المستخدم يسمح بكتابة أو تحرير أو تحديد كتل نصية متعددة الأسطر، مثل التعليقات أو الرسائل أو الأوصاف.
fr: La zone de texte est un élément d'interface utilisateur qui permet de saisir, de modifier ou de sélectionner plusieurs lignes de données textuelles, telles que des commentaires, des messages ou des descriptions.

# app_components_textArea_errorDescription_label
source: Error description
ar: وصف الخطأ
fr: Message d'erreur

# app_components_textAreaHelperText_label
source: Helper text.
ar: نص مساعد.
fr: Texte d'aide.

# app_components_textInput_description_text
source: Text input is a UI element that allows to type, edit, or select single line of textual data, such as names, emails or search queries.
ar: إدخال النص هو عنصر من عناصر واجهة المستخدم يسمح بكتابة أو تحرير أو تحديد سطر واحد من البيانات النصية، مثل الأسماء أو عناوين البريد الإلكتروني أو استعلامات البحث.
fr: Le champ de saisie de texte est un élément d'interface utilisateur qui permet de saisir, de modifier ou de sélectionner une seule ligne de données textuelles, telles que des noms, des adresses électroniques ou des requêtes de recherche.

# app_components_textInput_errorDescription_label
source: Error description
ar: وصف الخطأ
fr: Message d’erreur

# app_components_textInputHelperText_label
source: Helper text.
ar: نص مساعد.
fr: Texte d'aide.

# app_components_toolbar_common_itemCount_label
source: Item count: %@
ar: عدد العناصر: %@
fr: Nombre d’items : %@

# app_components_toolbar_demo_backToConfiguration_label
source: Back to configuration
ar: العودة إلى الإعدادات
fr: Retour à la configuration

# app_components_toolbar_demo_content_label
source: Your content here!
ar: ضع محتواك هنا!
fr: Votre contenu de page ici !

# app_components_toolbar_demo_showDemo_label
source: Show Demo
ar: عرض تجريبي
fr: Montrer la demo

# app_components_toolbar_demoOption_tech
source: Demo options
ar: خيارات العرض التوضيحي
fr: Options de démonstration

# app_components_toolbar_leadingText_label
source: Leading text
ar: النص الرئيسي
fr: Texte du début

# app_components_toolbar_trailingText_label
source: Trailing text
ar: النص اللاحق
fr: Texte de fin

# app_components_toolbarItem_hint_a11y
source: This is a dumb accessibility label for a toolbar item
ar: هذا ملصق وهمي لعنصر شريط الأدوات
fr: Ceci est un label bidon pour un item de toolbar

# app_components_toolbarItem_label_a11y
source: Label for a button
ar: تسمية للزر
fr: Label pour un bouton

# app_components_topAppBar_demoOption_label
source: Demo option
ar: خيار العرض التوضيحي
fr: Option de démonstration

# app_components_topAppBar_description_text
source: App bar is a top-aligned component that displays the screen title and provides access to key actions and navigation elements.
ar: App bar هو مكون موجه من الأعلى يعرض عنوان الشاشة ويوفر الوصول إلى الإجراءات الرئيسية وعناصر التنقل.
fr: La barre d'application est un composant situé en haut de l'écran qui affiche le titre de l'écran et donne accès aux actions principales et aux éléments de navigation.

# app_components_topAppBar_hideBackButton_tech
source: Hide back button
ar: إخفاء زر الرجوع
fr: Cacher le bouton de retour

# app_components_topAppBar_title_label
source: Title
ar: عنوان
fr: Titre

# app_search_empty_results
source: No results for "%@"
ar: لا نتائج لـ «%@»
fr: Aucun résultat pour « %@ »

# app_search_navigation_title
source: Search
ar: بحث
fr: Rechercher

# app_search_placeholder
source: Search
ar: بحث
fr: Rechercher

# app_settings_themeSwitch_cancel
source: No, I will restart the app myself
ar: لا، سأعيد تشغيل التطبيق بنفسي
fr: Non, je vais relancer l’app moi-même

# app_settings_themeSwitch_description
source: You allowed in settings to restart app when theme changed to be sure available tokens are the expected ones
ar: لقد سمحت في الإعدادات بإعادة تشغيل التطبيق عند تغيير السمة للتأكد من أن الرموز المتاحة هي الرموز المتوقعة
fr: Vous avez défini dans les réglages de l’app qu’il faut relancer l’app si le thème venait à changer.

# app_settings_themeSwitch_restart
source: Ok, terminate the app
ar: حسنًا، قم بإنهاء التطبيق
fr: Oui, tuer l’app

# app_settings_themeSwitch_title
source: Theme switch and debugging
ar: تبديل السمة وتصحيح الأخطاء
fr: Changement de thème et débogage

# app_tokens_border_description_text
source: Borders are used for the stroke colours on components and also for the colours of divider lines for components like tables.
ar: الحدود تستخدم لألوان الإطار على المكونات وكذلك لألوان خطوط الفواصل للمكونات مثل الجداول.
fr: Les tokens Border sont utilisés pour les couleurs de contour sur les composants et pour les couleurs des lignes de séparation pour des composants comme les tableaux.

# app_tokens_color_description_text
source: Colour reinforces our brand identity and ensures consistency across all product experiences. The semantic tokens described are the onse you should use when building a mobile app.
ar: يُعزز اللون هوية علامتنا التجارية ويضمن الاتساق في جميع تجارب المنتجات. الرموز الدلالية المذكورة هي ما يُنصح باستخدامه عند إنشاء تطبيق جوال.
fr: Les tokens Color renforcent notre identité de marque et assurent la cohérence à travers toutes les expériences produit. Les tokens sémantiques décrits sont ceux que vous devez utiliser lors de la création d'une application mobile.

# app_tokens_color_unspecified_label
source: Unspecified
ar: غير محدد
fr: Non spécifié

# app_tokens_common_viewCodeExample_label
source: View token code example
ar: عرض مثال على رمز التوكن
fr: Voir l'exemple de code du token

# app_tokens_dimension_description_text
source: Dimension provides standard sizing and spacing to ensure visual consistency across the UI.
ar: توفر الأبعاد قياسات ومسافات قياسية لضمان التناسق البصري عبر واجهة المستخدم.
fr: Les tokens Dimension fournissent des tailles et des espacements standard pour assurer la cohérence visuelle à travers l'interface utilisateur.

# app_tokens_dimension_size_description_text
source: Size refers to the specific measurements used to define the dimensions of UI elements within the design system.
ar: الحجم يشير إلى القياسات المحددة المستخدمة لتعريف أبعاد عناصر واجهة المستخدم ضمن نظام التصميم.
fr: Les tokens Size font référence aux mesures spécifiques utilisées pour définir les dimensions des éléments de l'interface utilisateur dans le système de design.

# app_tokens_dimension_space_columnGapHeader_text
source: Column gap includes the horizontal spacing between objects.
ar: الفاصل الأفقي يشمل المسافة الرأسية بين العناصر.
fr: Les tokens Column Gap correspondent à l'espacement horizontal entre les objets.

# app_tokens_dimension_space_description_text
source: Space refers to the measurements used to define the spacing between UI elements.
ar: تشير المسافة إلى القياسات المستخدمة لتحديد المسافات بين عناصر واجهة المستخدم
fr: Les tokens Space font référence aux mesures utilisées pour définir l'espacement entre les éléments de l'interface utilisateur.

# app_tokens_dimension_space_fixedHeader_text
source: Fixed spacing refers to a constant distance between elements that remains the same regardless of factors like container size, screen resolution, or layout changes.
ar: ثابت يشير إلى مسافة ثابتة بين العناصر تظل كما هي بغض النظر عن عوامل مثل حجم الحاوية، دقة الشاشة، أو تغييرات التخطيط.
fr: Les tokens Fixed font référence à une distance constante entre les éléments qui reste la même quels que soient des facteurs tels que la taille du conteneur, la résolution de l'écran ou les changements de mise en page.

# app_tokens_dimension_space_insetHeader_text
source: Inset includes the left, right, top, and bottom padding, with all parameters being equal.
ar: الهوامش الداخلية تتضمن الحشو من اليسار واليمين والأعلى والأسفل، مع جميع المعلمات متساوية.
fr: Les tokens Inset correspondent au remplissage équivalant autour d’un objet (gauche, droit, supérieur et inférieur).

# app_tokens_dimension_space_paddingBlock_tech
source: Padding block
ar: Padding bock

# app_tokens_dimension_space_paddingBlockHeader_text
source: Padding block includes the top and bottom padding.
ar: تتضمن مساحة الحشو للكتلة الحشو من الأعلى والأسفل.
fr: Les tokens padding block correspondent au remplissage supérieur et inférieur.

# app_tokens_dimension_space_paddingInlineHeader_text
source: Padding inline includes the left and right padding of an object or a group of objects.
ar: الحشو الأفقي يشمل الحشو الأيسر والأيمن لعنصر أو مجموعة من العناصر.
fr: Les tokens de Padding inline définissent le remplissage gauche et droit d'un objet ou d'un groupe d'objets.

# app_tokens_dimension_space_rowGapHeader_text
source: Row gap includes the vertical spacing between objects.
ar: الفاصل بين الصفوف هو المسافة الرأسية بين العناصر.
fr: Les tokens Raw Gap correspondent à l'espacement verticaux entre les objets.

# app_tokens_dimension_space_scaledHeader_text
source: Scaled spacing refers to spacing that adjusts dynamically based on factors like container size, screen resolution, or layout elements.
ar: مقاس نسبياً يشير إلى المسافات التي تتكيف ديناميكياً بناءً على عوامل مثل حجم الحاوية، دقة الشاشة، أو عناصر التخطيط.
fr: Les tokens Scaled font référence à un espacement qui s'ajuste de manière dynamique en fonction de facteurs tels que la taille du conteneur, la résolution de l'écran ou les éléments de mise en page.

# app_tokens_elevation_description_text
source: Shadows are used to give the impression of distance or elevation between surfaces, which adds depth to our designs.
ar: تُستخدم الظلال لإعطاء انطباع بالمسافة أو الارتفاع بين الأسطح، مما يضيف عمقًا إلى تصاميمنا.
fr: Les tokens Elevation sont utilisés pour donner l'impression de distance ou d'élévation entre les surfaces, ce qui ajoute de la profondeur à nos designs.

# app_tokens_grid_description_text
source: Grids are used to position content and create consistent page layouts
ar: يتم استخدام الشبكات لتنظيم المحتوى وضمان تنسيق موحد لصفحات الموقع.
fr: Les tokens Grid sont utilisés pour positionner le contenu et créer des mises en page de page cohérentes.

# app_tokens_opacity_description_text
source: Opacity can help distinguish foreground elements from background elements, making content easier to read and important actions more noticeable.
ar: يمكن أن تساعد Opacity في تمييز عناصر المقدمة عن عناصر الخلفية، مما يجعل المحتوى أسهل في القراءة ويجعل الإجراءات المهمة أكثر وضوحًا.
fr: Les tokens Opacity peuvent aider à distinguer les éléments de premier plan des éléments d'arrière-plan, rendant le contenu plus facile à lire et les actions importantes plus visibles.

# app_tokens_typography_description_text
source: Font is our system of fonts and text styles. They enhance communication and reinforce the brand style.
ar: الخط هي نظام خطوطنا وأنماط النصوص لدينا. فهي تعزز التواصل وتؤكد على نمط العلامة التجارية.
fr: Les tokens Font (i.e. typographie) définissent notre système de polices de caractères et de styles de texte. Ils améliorent la communication et renforcent le style de la marque.

# app_tokens_typography_family_tech
source: family (%@),
ar: عائلة (%@)،

# app_topBar_mode_button_a11y
source: Change mode
ar: غيّر الوضع
fr: Changer de mode

# app_topBar_mode_button_automatic_a11y
source: Automatic
ar: تلقائي
fr: Automatique

# app_topBar_mode_button_dark_a11y
source: Dark
ar: داكن
fr: Sombre

# app_topBar_mode_button_hint_a11y
source: Tap to change the mode of the app
ar: انقر لتغيير وضع التطبيق
fr: Taper deux fois pour changer le mode de l'app

# app_topBar_mode_button_light_a11y
source: Light
ar: واضح
fr: Clair

# app_topBar_theme_button_a11y
source: Change theme
ar: تغيير الموضوع
fr: Changer de thème

# app_topBar_theme_button_hint_a11y
source: Tap to change the theme of the app
ar: انقر لتغيير سمة التطبيق
fr: Taper deux fois pour changer le thème de l'application

# core_pinCodeInput_digitLabel_a11y
source: Digit number %lld
ar: الرقم %lld
fr: Chiffre numéro %lld

# app_components_alert_description_text
source: Alert components are UI elements that display information, system feedback or status changes.
fr: Les composants d'alerte sont des éléments d'interface utilisateur qui affichent des informations, des retours système ou des changements d'état.
